[
  {
    "name": "Syed Sultan Ahmed",
    "client": "MD & Chief Learner - LXL Ideas, Innovating Educational Experiences!",
    "description": " Rakesh as a consultant is just brilliant! My company LXL Ideas used the consultancy services of Rakesh to review its brand strategy and brand positioning. We had a wonderful working experience with Rakesh as he is extremely knowledgeable and meticulous, his attention to detail and wisdom that comes through his experience is very useful. His strategies and inputs in shaping our brands were useful.",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Hussein Kandil",
    "client": "Regional Marketing Director MENA-SAS",
    "description": " It was an absolute privilege to work under Rakesh Asrani's leadership during my tenure at Unilever, where he served as the Sr Marketing Director Beverages for NAMET region. Rakesh's visionary approach and exceptional guidance significantly impacted both the team and our marketing strategies.",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Shobhit Malhotra ",
    "client": "VP & General Manager @ Colgate-Palmolive | Global Leadership, Sales & Marketing",
    "description": "Rakesh is a deep thinker, with amazing approach to understanding countries, categories, businesses that helps in making the right choices. He is a team player, an inspirational manager & an avid coach. Rakesh has a strong philosophical / spiritual connect with Gaia - that brings unique clarity and calm that transcends to all those he interacts with. Strongly recommend for senior strategic roles.",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Sapan Sharma",
    "client": "Chief Customer Development Officer - Global Ice Creams, Unilever",
    "description": "Marketeer par excellence! I have had the opportunity to work with Rakesh three times in the last 19 years and every time I am amazed with his ‘inquisitive mind’. Always a humble learner, a great team player and a delight to work with as a peer is how I always remember him.",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Pim Thanomkul",
    "client": "Regional Marketing Manager - Suntory",
    "description": "Rakesh has been a great kind strong team leader to our team with a strong vision/ passion to accelerate SEA growth. He’s very sharp and has a next level analytical skills!! It has been an honor being part of his team for the past 2+ years. I’ve learnt so much working with him. He has also created a family environment to our team making it’s so easy to wake up in the morning and come to work everyday.",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Memoria Dwi Prasita",
    "client": "Obsessed about Marketing",
    "description": "        Rakesh has been such a great partner and guru for Indonesia business. His exceptional category and market understanding has made him inseparable to Indonesia success, despite sitting in Global Asia role. During transformation period, he successfully laid a new structure in Innovation project management, orchestrated the harmony of the Global vision and local need, while continued to lend his hands (and brain!) to support market overcome its challenges. ",
    "image": "./assets/images/img1.jpg"
  },
  {
    "name": "Angarak Bandopadhyay",
    "client": "Consumer Insights | Brand Strategy | Creative | Client Partner | Experienced APAC Lead",
    "description": "                I have serviced Rakesh in my role as UL Account Lead for Kantar in Thailand. Rakesh is one of the most research savvy Marketing Directors I have known. He is able to appreciate and rightfully challenge any research outcome AND process/techniques; as much as the CMIs. Working with him and his team always brought the best in us because given his attention to detail as well as his appreciation of merging the same with big business picture, were the standards we had to push to keep. Three more things that used to impress my team and myself a lot is 1. his energy and non negotiable attitude to drive results 2. his support and appreciation for agency partners for good work 3. His team being as much of pleasure working with, as they too held similar high standards and support.All of which resulted in fantastic learning experience for me and my team."
  },
  {
    "name": "Ian MaskellIan Maskell",
    "client": "Unilever • Marketing • Strategy • Leadership • Brand Purpose • Market Entry • Food • China & SEA",
    "description": "         Rakesh is a brilliant marketing professional. He is strategic & creates a vision that others are inspired to follow BUT he is also a 'sleeves rolled up' kinda guy - he leads by example when it comes to getting things done. If Rakesh says something will happen, it will 100% happen! This powerful combination (& his deep integrity) makes Rakesh a wonderful guy to have on board. I am vey happy to provide more specific details if requested."
  },
  {
    "name": "Ashok R Shetty",
    "client": "Golden Visa/Investor/Partner/CFO/ Ex Unilever",
    "description": "         Rakesh is one of the best Business Leader I have got an opportunity to work with. He is a very composed person & keeps it simple, crisp and clear even while facing acute challenges. He as a leader who took care of his team , stakeholder and Business . With his strategic thinking and having a vision for the portfolio, he comes with out of the box ideas and persistently pursues to land them in to reality. He also enables his team with a free hand to take the lead while providing his guidance continuously to achieve the set goals. He keeps on challenging his team to give their best. I was associated as finance business partner and personally learned a lot working along with him. In a nutshell, he is a great leader, mentor, motivator, friend and above all an amazing person by heart. As the saying goes, a great leader leads the path by example and he is just a perfect one reflecting the same!"
  },
  {
    "name": "Jochanan Senf",
    "client": "GM Nutrition DACH | Business Lead Scratch Cooking Europe",
    "description": "        Rakesh is the kind of marketeer that you want on the team; consumer focused, eye for detail and strategic clarity. I had the pleasure of working with Rakesh in the Beverages business and more recently in the SEA Ice-Cream business. Under his marketing leadership we were able to pivot the portfolio and adding truly exciting products to our range. "
  },
  {
    "name": "Matt Close",
    "client": "President of Global Ice Cream at Unilever",
    "description": "           Rakesh is a consummate professional, an inspiring and caring leader and is deeply thoughtful about brand and category development. He has worked with me in both global and regional roles leading breakthrough innovation and impactful communication. He is deeply attuned to consumer insight, inspires creativity and always delivers the goods. His teams love working with him because he’s intellectually sharp, crystal clear, deeply compassionate and a role model new power leader prepared to create a great environment for people to flourish. I wholeheartily recommend Rakesh. "
  },
  {
    "name": "Zohaib Omar Dewan",
    "client": "FMCG Marketing & Strategy Director | Foods/Nutrition Business Group | Unilever",
    "description": "I had the pleasure of working with Rakesh at my time as Regional and Global Brand Manager across global brands in Turkey & Rotterdam. I enjoyed his terrific leadership, 'let's do’ attitude with a dedicated approach to his work. Not only does he possess exceptional strategic skills but he has an eye for data which drives big business impact.      "
  },
  {
    "name": "Alpana Titus",
    "client": "General Manager at Reckitt",
    "description": "        Rakesh is a highly experienced marketer with deep domain expertise in ice cream. His past P&L experience of working in large markets like Turkey and India have helped bring the operational lens and execution discipline in to his most recent SEA Regional Ice Cream Innovation role. Rakesh has worked closely with the countries in crafting the strategic innovation roadmap and in delivering multiple new innovation formats and concepts in the region to drive strong business results and impact. Rakesh has been a very valuable business partner in terms of SEAT Ice Cream growth agenda over the past three years."
  },
  {
    "name": "Amr Sharara",
    "client": "Head of Marketing @ Unilever | Brand Building | FMCG | ex PepsiCo | ex Nestle",
    "description": "          Rakesh is an outstanding mentor, great marketer and above all a super human being. What separates Rakesh from the others is his strong strategic vision, ability to balance short and long term vision & manage complex responsibilities. Besides being a joy to work with Rakesh is a super organized with strong analytical skill sand deep attention to details. Under his leadership we managed to create successful creative stories and exciting products. Rakesh is a great leader who leads by example and always the number one supporter and fan of this team."
  },
  {
    "name": "Rajesh Shirali",
    "client": "Data Science Lead-South Asia at Nielsen",
    "description": " Rakesh has the rare ability to see the big picture while also being detail oriented. His attention to detail in every aspect of marketing mix development speaks a lot about his passion for marketing. And he is a multi-faceted personality-who can pull off a meaningful conversation on any topic under the sun. A joy to work with!"
  }
]
