[
  {
    "title": "Business Growth Strategy",
    "description": [
      {
        "content": "Strategy and planning are complimentary to each other, not a substitute for each other ! Strategy is a set of integrated actions that help you win in the segments where you decide to play. Planning is a set of sequential actions to get things."
      },
      {
        "content": "All organizations have a business plan but, less than 15% have a clear growth strategy that positions them to win in the market. We work closely with CEO’s & founders to help them create winning growth strategies around the choices of ‘where to play’ and ‘how to win’. The approach we use brings together leading edge strategic tools, creativity and design thinking methodologies to create an actionable strategy that maximizes the growth potential of the business."
      }
    ],
    "image": "./assets/images/img1.jpg"
  },
  {
    "title": "Iconic Branding",
    "description": [
      {
        "content": "Iconic brands, that consumers can’t help but fall in love with, and pay a premium for, are one of the biggest drivers of share holder value. Iconic Brands are a repository of not merely functional characteristics but of meaning and value. We work with CMO’s and their brand teams to help them craft Iconic brand positioning that infuses meaning into their brands and deploy them brilliantly in the market."
      }
    ],
    "image": "./assets/images/img1.jpg"
  },
  {
    "title": "Agile Innovation ",
    "description": [
      {
        "content": "Innovations are the life blood of any organization and an engine for sustainable competitive growth. However over 90% of innovations fail in the market. We work with organizations, using agile innovation methodologies, to take the ‘luck out of innovation’ and dramatically increase the odds of success. Agile innovation put’s the consumer at the heart of the innovation process, has tools and frameworks to understand ‘consumer jobs’ & how an organization can use its capabilities to deliver superior solutions."
      }
    ],
    "image": "./assets/images/img1.jpg"
  }
]
